app/controllers/articles_controller.rb

  def create
    # render plain: params[:article].inspect
    @article = Article.new(safeparams)
    if @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "1"], ["text", "one"], ["created_at", "2015-11-27 07:27:00.000412"], ["updated_at", "2015-11-27 07:27:00.000412"]]

  def update
    @article = Article.find(params[:id])

    if @article.update(safeparams)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "articles" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "second article"], ["text", "two"], ["updated_at", "2015-11-27 09:02:17.925951"], ["id", 2]]